
# Parameters
nc: 80  # number of classes
scales: 
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3
  - [-1, 1, Blocks, [64, LFEBBase, 2, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, LFEBBase, 2, 3, 'relu']] # 5
  - [-1, 1, Blocks, [256, LFEBBase, 2, 4, 'relu']] # 6
  - [-1, 1, Blocks, [512, LFEBBase, 2, 5, 'relu']] # 7

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 12 
  - [[-1, -2, 10], 1, Msfc, []]  # 13
  - [-1, 3, RetBlockC3, [256, 0.5, 'chunk', 8]]    # 14
  - [-1, 1, Conv, [256, 1, 1]]   # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 17
  - [[-1, -2, 15], 1, Msfc, []]  # 18
  - [-1, 3, RetBlockC3, [256, 0.5, 'chunk', 8]]      # 19
  
  - [4, 1, SPDConv, [128]] # 20
  - [[5, 6, 8], 1, Threedstack, [128]] # 21
  - [[-1, -2], 1, Concat, []] # 22
  - [[19, -1], 1, Soem, []] # 23
  
  - [-1, 1, Conv, [256, 3, 2]]   # 24
  - [[-1, 15], 1, Concat, [1]]  # 25 
  - [-1, 3, RetBlockC3, [256, 0.5, 'chunk', 8]]      # 26

  - [-1, 1, Conv, [256, 3, 2]]   # 27
  - [[-1, 10], 1, Concat, [1]]  # 28 
  - [-1, 3, RetBlockC3, [256, 0.5, 'chunk', 8]]     # 29

  - [[23, 26, 29], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 6]]  