# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3

  - [-1, 1, Blocks, [64, BottleNeck, 3, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BottleNeck, 4, 3, 'relu']] # 5
  - [-1, 1, Blocks, [256, BottleNeck, 6, 4, 'relu']] # 6
  - [-1, 1, Blocks, [512, BottleNeck, 3, 5, 'relu']] # 7
head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 12 
  - [[-2, -1], 1, Concat, [1]] # 13
  - [-1, 3, RepC3, [256]]  # 14
  - [-1, 1, Conv, [256, 1, 1]]   # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 17 
  - [[-2, -1], 1, Concat, [1]]  # 18
  - [-1, 3, RepC3, [256]]    # 19

  - [-1, 1, Conv, [256, 3, 2]]   # 20,
  - [[-1, 15], 1, Concat, [1]]  # 21 
  - [-1, 3, RepC3, [256]]    # 22

  - [-1, 1, Conv, [256, 3, 2]]   # 23
  - [[-1, 10], 1, Concat, [1]]  # 24 
  - [-1, 3, RepC3, [256]]    # 25

  - [[19, 22, 25], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 6]]  
